app/Models/Pegawai_model.php

SELECT *
FROM `pegawai`
---
    public function getPegawai()
    {
        return $this->findAll();